INSERT INTO singers (singer_name)
VALUES ('Muse'),
('Полина Гагарина'),
('Баста'),
('Анна Герман'),
('The Beatles'),
('Севара'),
('Альянс'),
('Fleetwood Mac'),
('Metallica'),
('Кино');

INSERT INTO genre (genre_name)
VALUES ('Постпанк'),
('Фолк-рок'),
('Рок'),
('Хеви-метал'),
('Хард-рок'),
('Рок-н-ролл'),
('Блюз-рок'),
('Блюз'),
('Альтернативный рок'),
('Рэп'),
('Фолк'),
('Хип-хоп'),
('Романс'),
('Эстрада'),
('Регги'),
('Поп');

INSERT INTO singer_genre(genre_id, singer_id)
VALUES (1,1), (2,1),
(14,2),(16,2),
(10,3),(12,3),
(11,4),(13,4),(14,4),
(3,5),(6,5),
(11,6),(16,6),
(7,7),(9,7),
(7,8),(11,8),(15,8),
(3,9),(4,9),(5,9),
(1,10),(3,10),(7,10),(8,10);

INSERT INTO albums(album_name, release_year)
VALUES ('Письма', 2013),
('Баста 2', 2007),
('Баста 40', 2020),
('Simulation Theory', 2018),
('Help!', 1965),
('Вдох', 2022),
('Группа крови', 1988),
('Rumours', 1977),
('72 Seasons', 2018),
('Revolver', 2019);

INSERT INTO records(record_name, record_duration, album_id)
VALUES ('Там нет меня', '00:03:30', 1),
('Моя игра', '00:04:30', 2),
('Сансара', '00:06:02', 2),
('Выпускной', '00:05:35', 3),
('Мой путь', '00:03:10', 3),
('Starlight', '00:04:03', 4),
('Uprising', '00:05:04', 4),
('I will', '00:01:36', 5),
('Кукушка', '00:03:52', 6),
('Бабочки', '00:03:08', 6),
('Группа крови', '00:04:12', 7),
('Пачка сигарет', '00:04:35', 7),
('Dreams', '00:04:14', 8),
('My way', '00:02:35', 8),
('Nothing else matters', '00:06:35', 9),
('Staying alive', '00:02:36', 9),
('Rubber soul', '00:01:36', 10);

INSERT INTO collections(collection_name, release_year)
VALUES ('Рок хиты 2018', 2018),
('Караоке 2019 лучшее', 2019),
('Дорожные', 2012),
('Кино лучшее', 1999),
('Золотая коллекция', 2020),
('Для поездок', 1967),
('Застольные', 2020),
('Поп музыка лучшее 2022', 2022),
('Караоке 2020', 2020);

INSERT INTO singer_album (singer_id, album_id)
VALUES (1, 4), 
(2, 6),
(3, 2),
(3, 3),
(5, 5),
(6, 1),
(10,7),
(8, 8),
(9, 9);

INSERT INTO collection_record (collection_id, record_id)
VALUES (1, 5), (1, 8), (1, 11), (1, 12), (1, 14),
(2, 1), (2, 2), (2, 9),
(3, 5), (3, 14),
(4, 11),(4, 12),
(5, 5), (5, 16), (5, 15),
(6, 1), (6, 10),
(7, 7), (7, 1), (7, 13), (7, 3),
(8, 4), (8,6), (8, 3),
(9, 15), (9, 16);




